inter/withoutExtensionFilling/0/blueprints/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  BAW-Blaupause                         |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.e-11;

/*
    Einlauf: Vorgegebener Volumenstrom: inletOutlet (fester Wert beim Einstroemen, freier Transport nach aussen, 
    Wert kann z.B. abgeschaetzt werden mit k=3/2*(u*TI)² ,u: mittlere Geschwindigkeit, TI: turbulente Intensitaet)
    Auslauf: Vorgegebener Wasserstand (am Auslauf): inletOutlet (fester Wert beim Einstroemen, freier Transport nach aussen)
    Wand: kqRWallFunction (= zeroGradient, bei Vorgabe einer Sandrauheit in nut) oder zeroGradient (slip)

    Wenn unklar: fixedValue oder zeroGradient   

    ACHTUNG: Den "Deckel" wie vorgegebenen Wasserstand behandeln, wenn er offen sein soll (sonst als Wand)!
*/

boundaryField
{
    xmin
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    
    xmax
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    
    ymin
    {
        type            zeroGradient;
    }
    
    ymax
    {
        type            zeroGradient;
    }
    
    zmin
    {
        type            zeroGradient;
    }
    
    zmax
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    
    pfeiler
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }
    
    "sohle_.*"
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }
    
    // Wird nach Gitter-Manipulationen oft gebraucht!
    oldInternalFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
